#include "z_boss_ganon.h"
#include "overlays/actors/ovl_En_Ganon_Mant/z_en_ganon_mant.h"
#include "overlays/actors/ovl_En_Zl3/z_en_zl3.h"
#include "overlays/actors/ovl_Bg_Ganon_Otyuka/z_bg_ganon_otyuka.h"

#define FLAGS 0x00000035

#define THIS ((BossGanon*)thisx)

void BossGanon_Init(Actor* thisx, GlobalContext* globalCtx);
void BossGanon_Destroy(Actor* thisx, GlobalContext* globalCtx);
void BossGanon_Update(Actor* thisx, GlobalContext* globalCtx);
void BossGanon_Draw(Actor* thisx, GlobalContext* globalCtx);

void func_808E1EB4(Actor* thisx, GlobalContext* globalCtx); // update
void func_808E2544(Actor* thisx, GlobalContext* globalCtx); // update
void func_808E1034(Actor* thisx, GlobalContext* globalCtx); // update
void func_808E229C(Actor* thisx, GlobalContext* globalCtx); // draw
void func_808E324C(Actor* thisx, GlobalContext* globalCtx); // draw
void func_808E1B54(Actor* thisx, GlobalContext* globalCtx); // draw

// action functions
void func_808D779C(BossGanon* this, GlobalContext* globalCtx);
void func_808D90F8(BossGanon* this, GlobalContext* globalCtx);
void func_808D7918(BossGanon* this, GlobalContext* globalCtx);
void func_808D933C(BossGanon* this, GlobalContext* globalCtx);
void func_808DBB78(BossGanon* this, GlobalContext* globalCtx); // wait

void func_808DBF30(BossGanon* this, GlobalContext* globalCtx); // spawn light ball
void func_808DC14C(BossGanon* this, GlobalContext* globalCtx); // throw light ball

void func_808DAD20(BossGanon* this, GlobalContext* globalCtx); // pound the floor

void func_808DB2E8(BossGanon* this, GlobalContext* globalCtx); // charge up thing

void func_808DC4DC(BossGanon* this, GlobalContext* globalCtx);
void func_808DC75C(BossGanon* this, GlobalContext* globalCtx);
void func_808DCB7C(BossGanon* this, GlobalContext* globalCtx);
void func_808DD14C(BossGanon* this, GlobalContext* globalCtx);

// setup action
void func_808DBAF0(BossGanon* this, GlobalContext* globalCtx); // wait
void func_808DACE8(BossGanon* this, GlobalContext* globalCtx); // pound the floor

void func_808DBEC4(BossGanon* this, GlobalContext* globalCtx); // spawn light ball
void func_808DC0E8(BossGanon* this, GlobalContext* globalCtx); // throw light ball

void func_808DB278(BossGanon* this, GlobalContext* globalCtx); // charge up

/*
const ActorInit Boss_Ganon_InitVars = {
    ACTOR_BOSS_GANON,
    ACTORTYPE_BOSS,
    FLAGS,
    OBJECT_GANON,
    sizeof(BossGanon),
    (ActorFunc)BossGanon_Init,
    (ActorFunc)BossGanon_Destroy,
    (ActorFunc)BossGanon_Update,
    (ActorFunc)BossGanon_Draw,
};
*/
// data
extern InitChainEntry D_808E4C84[];
extern ColliderCylinderInit D_808E4C00;
extern ColliderCylinderInit D_808E4C2C;
extern AnimationHeader* D_808E4D38[];
extern s16 D_808E4D40[];
extern Vec3f D_808E4C6C; // zeroVec?
extern f32 D_808E4D44[];
extern u8 D_808E4C58[];
extern Color_RGB8 D_808E4C78[];

typedef struct {
    /* 0x00 */ Vec3s eye;
    /* 0x06 */ Vec3s at;
} CutsceneCameraPosition; // size = 0x12

extern CutsceneCameraPosition D_808E4C94[];

// CutsceneCameraPosition D_808E4C94[] = {
//     { { 0, 40, 0 }, { 0, 50, 430 } },
//     { { -20, 30, 400 }, { 10, 55, 440 } },
//     { { 0, 60, 300 }, { 0, 273, -150 } },
//     { { 0, 180, -260 }, { 0, 155, -300 } },
//     { { -30, 60, 440 }, { 20, 25, 390 } },
//     { { -50, 140, -360 }, { 50, 92, -390 } },
//     { { -10, 264, -121 }, { 5, 266, -160 } },
//     { { -13, 200, -310 }, { 0, 125, -410 } },
//     { { 0, 40, -50 }, { 0, 35, 230 } },
//     { { 0, 140, -250 }, { 0, 115, -570 } },
//     { { -410, 150, -130 }, { 50, 155, -170 } },
//     { { 0, 130, -230 }, { 0, 125, -2000 } },
//     { { -2, 147, -293 }, { -200, 345, -2000 } },
// };

// bss

typedef struct {
    /* 0x00 */ u8 type;
    /* 0x01 */ s8 unk_01;
    /* 0x04 */ Vec3f pos;
    /* 0x10 */ Vec3f velocity;
    /* 0x1C */ Vec3f accel;
    /* 0x28 */ Color_RGB8 color; // this might not be a color
    /* 0x2B */ u8 unk_2B;
    /* 0x2C */ s16 unk_2C;
    /* 0x2E */ s16 unk_2E;
    /* 0x30 */ s16 unk_30;
    /* 0x34 */ f32 unk_34;
    /* 0x38 */ f32 unk_38;
    /* 0x3C */ f32 unk_3C;
    /* 0x40 */ f32 unk_40;
    /* 0x44 */ f32 unk_44;
    /* 0x48 */ f32 unk_48;
} GanondorfEffect; // size = 0x4C

extern GanondorfEffect sCustomEffects[200];
extern EnGanonMant* sCape; // D_808F93C0
// D_808F93C4
// D_808F93C8
// D_808F93CC
extern BossGanon* sGanondorf; // D_808F93D0
extern EnZl3* sZelda;         // D_808F93D4

// segments
extern u8 D_0600CF00[]; // title card texture
extern SkeletonHeader D_060114E8;
extern AnimationHeader D_06005FFC;
extern AnimationHeader D_060089F8;
extern AnimationHeader D_0600EA00;
extern AnimationHeader D_06004F64;
extern AnimationHeader D_06006AF4;
extern AnimationHeader D_06004304;
extern AnimationHeader D_06001F58;
extern AnimationHeader D_06003018;
extern AnimationHeader D_06007268;
extern AnimationHeader D_06007A64;
extern AnimationHeader D_06008A88;
extern AnimationHeader D_06009A14;
extern AnimationHeader D_0600AA24;
extern AnimationHeader D_0600738C;
extern AnimationHeader D_06009A14;
extern AnimationHeader D_06002D2C;
extern AnimationHeader D_0600343C;
extern AnimationHeader D_06001B0C;
